# 一、在百元百鸡问题的基础上，找出公鸡最多、母鸡最多和小鸡最多的方案，并输出对应结果
# 解题思路：设公鸡a只，母鸡b只，小鸡c只，由题可得3a+5b+c/3=100且a+b+c=100,带入方程式可以得到母鸡数量b=(100-4a)/7，小鸡数量c=(600-3a)/7
# 要得到公鸡最大的解，可以以公鸡数量建立循环，让公鸡从最大值开始循环，在第一次得到满足条件的结果后，结束循环并输出结果
for a in range(32,0,-1):
    if 3*a+5*((100-4*a)//7)+((600-3*a)//7)//3 and a+(100-4*a)//7+(600-3*a)//7 == 100 and 100-4*a >= 7 and 600-3*a >= 7:
            print('公鸡最多的方案为：%d只'%(a))
            break

# 要得到母鸡最大的解，只需要将循环条件改为母鸡的数量即可
for b in range(20,0,-1):
    if 3*(100-7*b)//4+5*b+((300+3*b)//4)//3 and (100-7*b)//4+b+(300+3*b)//4 == 100 and (100-7*b) >= 4 and 300+3*b >= 4:
            print('母鸡最多的方案为：%d只'%(b))
            break

# 同理要得到小鸡最大的解，只需要将循环条件改为小鸡的数量即可
for c in range(99,0,-1):
    if 3*((600-7*c)//3)+5*((4*c-300)//3)+c//3 and (600-7*c)//3+(4*c-300)//3+c == 100 and 600-7*c >= 3 and 4*c-300 >= 3:
            print('小鸡最多的方案为：%d只'%(c))
            break
